### Marketing Dataset Analysis

### Part 1: Data Importing & Cleaning

__Data Importing and Pre-processing__

In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns

__Reading Data__

The dataset was provided as an excel file. I saved it as a CSV in order to read into jupyter notebook to perform preprocessing, exploratory data analysis, and data visualizations.

In [2]:
df = pd.read_csv('./data/Data_Analysis_Exercise.csv')
df.head()

    Month State  Brand Customers    Value Age Group Gender VIP Band
0  Jul-19    SA  Apple       256   50,623     18-24      F  Group A
1  Jul-19    SA  Apple       147   34,629     18-24      F  Group B
2  Jul-19    SA  Apple        36   85,034     18-24      F  Group C
3  Jul-19    SA  Apple       109  220,479     18-24      F  Group D
4  Jul-19    SA  Apple        52   15,644     18-24      M  Group A

__Brief overview of observations__

In [3]:
df.shape

(47200, 8)

<span style="color: blue"> 47,200 observations and 8 features.

In [4]:
df.dtypes

Month        object
State        object
Brand        object
Customers    object
Value        object
Age Group    object
Gender       object
VIP Band     object
dtype: object

__Updates to column headers__

In [5]:
df.columns = [column.replace (' ','_') for column in df.columns]

In [6]:
#lower casing
df.columns = [column.lower() for column in df.columns]

In [7]:
df.head()

    month state  brand customers    value age_group gender vip_band
0  Jul-19    SA  Apple       256   50,623     18-24      F  Group A
1  Jul-19    SA  Apple       147   34,629     18-24      F  Group B
2  Jul-19    SA  Apple        36   85,034     18-24      F  Group C
3  Jul-19    SA  Apple       109  220,479     18-24      F  Group D
4  Jul-19    SA  Apple        52   15,644     18-24      M  Group A

__Check for nulls__

In [8]:
#List of all column data type and null values.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47200 entries, 0 to 47199
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   month      47200 non-null  object
 1   state      47200 non-null  object
 2   brand      47200 non-null  object
 3   customers  47200 non-null  object
 4   value      47200 non-null  object
 5   age_group  47200 non-null  object
 6   gender     47200 non-null  object
 7   vip_band   47200 non-null  object
dtypes: object(8)
memory usage: 2.9+ MB

In [9]:
#Sum of all null values for each feature
df.isnull().sum()

month        0
state        0
brand        0
customers    0
value        0
age_group    0
gender       0
vip_band     0
dtype: int64

__Seperated the month and year from the initial 'month' column for easier analysis.__

In [10]:
#Seperating the month column
df['months']= df['month'].str[0:3]

In [11]:
#changing the positioning of the newly seperated column
first_column = df.pop('months')

In [12]:
df.insert(0,'months',first_column)

In [13]:
df.head()

  months   month state  brand customers    value age_group gender vip_band
0    Jul  Jul-19    SA  Apple       256   50,623     18-24      F  Group A
1    Jul  Jul-19    SA  Apple       147   34,629     18-24      F  Group B
2    Jul  Jul-19    SA  Apple        36   85,034     18-24      F  Group C
3    Jul  Jul-19    SA  Apple       109  220,479     18-24      F  Group D
4    Jul  Jul-19    SA  Apple        52   15,644     18-24      M  Group A

In [14]:
#Seperating the year column
df['year']= df['month'].str[4:7]

In [15]:
#changing the data type to an integer
df['year'] = df['year'].astype('int')

In [16]:
#changing the positioning of the newly seperated column
second_column = df.pop('year')

In [17]:
df.insert(1,'year',second_column)

In [18]:
#dropping the original 'month' column
df.drop('month', axis =1, inplace = True)

In [19]:
df.head()

  months  year state  brand customers    value age_group gender vip_band
0    Jul    19    SA  Apple       256   50,623     18-24      F  Group A
1    Jul    19    SA  Apple       147   34,629     18-24      F  Group B
2    Jul    19    SA  Apple        36   85,034     18-24      F  Group C
3    Jul    19    SA  Apple       109  220,479     18-24      F  Group D
4    Jul    19    SA  Apple        52   15,644     18-24      M  Group A

__Categorical Features__

Changed the following features to categorical data types.

__Customers and Value features__

In [20]:
df['state'] = df.state.astype('category')

In [21]:
df['brand'] = df.brand.astype('category')

In [22]:
df['age_group'] = df.age_group.astype('category')

In [23]:
df['gender'] = df.gender.astype('category')

In [24]:
df['vip_band'] = df.vip_band.astype('category')

Changed the 'customers' and 'value' column observations to integers for further analysis. 
Noted some entries had commas, removed those first in order to turn the data type into a float for me to perform EDA moving forward.

In [25]:
#removing commas
df['customers'] =[float(str(i).replace(',','')) for i in df['customers']]

In [26]:
#changing data type to integers
df['customers'] = df.customers.astype('int')

In [27]:
#removing commas
df['value'] =[float(str(i).replace(',','')) for i in df['value']]

In [28]:
#changing data type to integers
df['value'] = df.value.astype('int')

In [29]:
df.dtypes

months         object
year            int64
state        category
brand        category
customers       int64
value           int64
age_group    category
gender       category
vip_band     category
dtype: object

In [30]:
#saving updated/cleaned csv for EDA in notebook 2
df.to_csv('./data/Data_Analysis_Exercise_Cleaned.csv')